{
  "gameName": "Be the Odd One",
  "gameDescription": "Stand out with your unique answers!",
  "createRoom": "Create Room",
  "joinRoom": "Join Room",
  "enterName": "Enter your name",
  "enterRoomId": "Enter Room ID",
  "creating": "Creating...",
  "joining": "Joining...",
  "LanguageSwitcher": {
    "switchLanguage": "Switch language",
    "switchToEnglish": "Switch to English",
    "switchToTurkish": "Türkçe'ye geç"
  },
  "switchToEnglish": "Switch to English",
  "switchToTurkish": "Türkçe'ye geç",
  "RoomContent": {
    "loadingGameState": "Loading...",
    "waitingForOtherPlayers": "Waiting for other players",
    "answerSubmitted": "You've submitted your answer. Please wait for other players to submit their answers.",
    "gameName": "Be the Odd One"
  },
  "GameResults": {
    "gameResults": "Game Results",
    "winner": "Winner",
    "celebrate": "Celebrate!",
    "themeSummary": "Theme Summary",
    "by": "by",
    "playAgain": "Play Again",
    "resettingGame": "Resetting Game...",
    "waitingForHost": "Waiting for the host to start a new game...",
    "points": "Points",
    "showThemeSummary": "Show Theme Summary",
    "hideThemeSummary": "Hide Theme Summary"
  },
  "AnswerReviewScreen": {
    "answersForTheme": "Answers for the theme:",
    "themeBy": "Theme by:",
    "hostInstructions": "Host Instructions",
    "hostInstructionsText": "As the host, review the answers and mark any as invalid if they are irrelevant to the theme or essentially duplicate answers.",
    "playersNotEarningPoints": "Players not earning points this round:",
    "duplicateAnswer": "Duplicate Answer",
    "invalidAnswer": "Invalid Answer",
    "duplicateTooltip": "This answer matches with another player's. No points awarded.",
    "invalidTooltip": "The host has marked this answer as invalid for this round. No points will be awarded.",
    "markAsInvalid": "Mark as Invalid",
    "finishingReview": "Finishing Review...",
    "finishReview": "Finish Review",
    "waitingForHost": "Waiting for the host to finish reviewing answers...",
    "point": "point",
    "points": "points",
    "noPoints": "No points",
    "firstToSubmit": "First to answer!",
    "voteToInvalidate": "Vote to Invalidate",
    "votesToInvalidate": "Votes to Invalidate: ",
    "votedToInvalidate": "Voted to invalidate"
  },
  "ThemeInput": {
    "enterThemes": "Enter Themes",
    "addThemesInstructions": "Add themes for the game.",
    "hostInstructions": "As the host, you can remove themes and start the game.",
    "waitForHost": "The host will start the game when ready.",
    "enterTheme": "Enter a theme",
    "add": "Add",
    "adding": "Adding...",
    "themePool": "Theme Pool",
    "noThemesSubmitted": "No themes submitted yet.",
    "by": "by",
    "startGame": "Start Game",
    "startingGame": "Starting Game..."
  },
  "AnswerInput": {
    "theme": "Theme:",
    "enterAnswer": "Enter your answer for this theme",
    "enterAnswerPlaceholder": "Enter your answer",
    "submitAnswer": "Submit Answer",
    "submitting": "Submitting...",
    "answerSubmitted": "Answer Submitted!",
    "waitingForOthers": "Your answer has been recorded. Please wait for other players to submit their answers.",
    "playerAnswered": "{playerName} has answered!",
    "timeRemaining": "You have 10 seconds to answer!"
  },
  "GameProgress": {
    "questions": "Questions",
    "playerScores": "Player Scores",
    "playerReady": "Player ready",
    "playerNotReady": "Player not ready",
    "gameProgress": "Game Progress"
  },
  "PlayerCard": {
    "host": "Host"
  },
  "JoinForm": {
    "joinTheGame": "Join the Game",
    "enterNameToJoin": "Enter your name to join the room",
    "enterYourName": "Enter your name",
    "joining": "Joining...",
    "joinGame": "Join Game"
  },
  "LanguageSelector": {
    "selectLanguage": "Select Language"
  },
  "ThemePackSelector": {
    "selectThemePack": "Select Theme Pack",
    "filterByLanguage": "Filter by Language",
    "selectLanguage": "Select Language"
  },
  "GameSettings": {
    "themeSource": "Theme Source",
    "gameSettings": "Game Settings",
    "customThemes": "Custom Themes",
    "themePacks": "Theme Packs",
    "timedMode": "Timed Mode",
    "numberOfThemesFromPack": "Number of Themes",
    "onlyHostCanChange": "Only the host can change game settings.",
    "timedModeOn": "Timed Mode: On",
    "timedModeOff": "Timed Mode: Off",
    "collapseSettings": "Collapse Settings",
    "expandSettings": "Expand Settings"
  },
  "ScrollableScoreList": {
    "scoreboardTitle": "Scoreboard",
    "score": "Score",
    "leader": "Leader"
  },
  "HowToPlay": {
    "title": "How to Play",
    "gameObjective": "Game Objective",
    "gameObjectiveDesc": "Think fast and be creative! Answer prompts based on themes and earn points for unique answers.",
    "howToPlayTitle": "How to Play",
    "step1": "Join or create a room and wait for at least 3 players.",
    "step2": "Each round, you'll see a theme and need to provide a relevant answer.",
    "step3": "Be quick! In timed mode, faster answers get more points.",
    "step4": "Avoid duplicate answers - they won't earn any points!",
    "scoringTitle": "Scoring",
    "scoringDesc": "Earn points for unique answers. First valid answers get bonus points in timed mode!",
    "tipsTitle": "Tips for Success",
    "tip1": "Be creative and think outside the box!",
    "tip2": "Keep an eye on the timer in timed mode.",
    "tip3": "Try to avoid obvious answers that others might think of."
  },
  "PlayerList": {
    "host": "Host",
    "players": "Players"
  },
  "Header": {
    "home": "Home",
    "privacy": "Privacy",
    "termsOfService": "Terms of Service",
    "about": "About"
  },
  "Lobby": {
    "howToPlay": "How to Play",
    "gameObjectiveDesc": "Think fast and be creative! Answer prompts based on themes and earn points for unique answers.",
    "step1Custom": "Players take turns submitting themes for each round.",
    "step1ThemePack": "Themes are automatically selected from the chosen theme pack.",
    "step2": "Everyone races to provide a unique answer to the current theme.",
    "step3": "Answers are revealed, and points are awarded for originality.",
    "step4": "The player with the most points at the end wins!",
    "stepTitle1Custom": "Submit Themes",
    "stepTitle1ThemePack": "Theme Selection",
    "stepTitle2": "Answer Quickly",
    "stepTitle3": "Score Points",
    "stepTitle4": "Win the Game",
    "protip": "Pro Tip: Think outside the box for truly unique answers!",
    "minPlayers": "Minimum 3 players required to start",
    "roomId": "Room ID",
    "copied": "Copied!",
    "gameSettings": "Game Settings",
    "copyGameLink": "Invite!",
    "shareLink": "Share this link with others to invite them to the game!",
    "players": "Players",
    "needMorePlayers": "At least 3 players are required to start the game. Invite more players to join!",
    "startingGame": "Starting Game...",
    "startGame": "Start Game",
    "needThreePlayers": "Need at least 3 players to start",
    "waitingForGameToStart": "Waiting for the game to start",
    "themePackSelected": "Theme pack has been selected",
    "settings": "Settings"
  },
  "RoundStartCountdown": {
    "roundStarting": "Round Starting",
    "getReady": "Get ready! The next round is about to begin..."
  },
  "PrivacyPolicy": {
    "title": "Privacy Policy",
    "lastUpdated": "Last Updated: February 23, 2024",
    "introduction": {
      "title": "Introduction",
      "content": "This Privacy Policy describes how Be the Odd One ('we', 'our', or 'us') collects, uses, and shares your personal information when you use our website and play our game."
    },
    "informationCollection": {
      "title": "Information We Collect",
      "content": "We collect several types of information from and about users of our website, including:",
      "items": {
        "personal": "Personal information that you provide to us, such as your name and email address.",
        "usage": "Usage data about how you interact with our game and website.",
        "device": "Device and browser information, including your IP address, browser type, and operating system.",
        "cookies": "Information collected through cookies and similar tracking technologies."
      }
    },
    "cookies": {
      "title": "Cookies and Advertising",
      "content": "We use cookies and similar tracking technologies to track activity on our website and hold certain information. You can instruct your browser to refuse all cookies or to indicate when a cookie is being sent.",
      "advertising": "We may use third-party advertising services on our website. These services may use cookies and similar technologies to serve ads based on your prior visits to our website or other websites.",
      "thirdPartyVendors": "Third-party vendors may use cookies to serve ads based on your prior visits to our website and other websites on the Internet.",
      "personalization": "The use of advertising cookies enables our advertising partners to serve ads that may be relevant to you based on your browsing behavior.",
      "optOut": "You may opt out of personalized advertising by visiting www.aboutads.info or the Network Advertising Initiative's opt-out page at www.networkadvertising.org/choices/."
    },
    "dataUse": {
      "title": "How We Use Your Information",
      "content": "We use the information we collect to:",
      "items": {
        "operation": "Operate and improve our website and game",
        "personalization": "Personalize your gaming experience",
        "communication": "Communicate with you about our services",
        "advertising": "Deliver relevant advertising to you",
        "analytics": "Analyze how our website and game are used"
      }
    },
    "dataSharing": {
      "title": "Information Sharing",
      "content": "We may share your information with:",
      "items": {
        "serviceProviders": "Third-party service providers who assist us in operating our website and providing our services",
        "advertising": "Advertising partners who help us deliver relevant advertisements",
        "legal": "Law enforcement or others if required by law",
        "business": "Business partners in the event of a corporate sale, merger, or acquisition"
      }
    },
    "security": {
      "title": "Data Security",
      "content": "We have implemented appropriate technical and organizational security measures designed to protect the security of any personal information we process."
    },
    "childPrivacy": {
      "title": "Children's Privacy",
      "content": "Our Service does not address anyone under the age of 13. We do not knowingly collect personally identifiable information from anyone under the age of 13."
    },
    "changes": {
      "title": "Changes to This Privacy Policy",
      "content": "We may update our Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page and updating the 'Last Updated' date."
    },
    "contact": {
      "title": "Contact Us",
      "content": "If you have any questions about this Privacy Policy, please contact us at mertaslan16@gmail.com"
    }
  },
  "TermsOfService": {
    "title": "Terms of Service",
    "lastUpdated": "Last Updated: February 23, 2024",
    "introduction": {
      "title": "Introduction",
      "content": "Welcome to Be the Odd One. These Terms of Service ('Terms') govern your use of our website ('Site') and game ('Game'). By accessing or using our Site or Game, you agree to be bound by these Terms. If you disagree with any part of the Terms, you may not access the Site or use our Game."
    },
    "acceptance": {
      "title": "Acceptance of Terms",
      "content": "By creating an account or using our services, you confirm that you are at least 13 years old and that you understand and agree to these Terms. If you are under 18, you confirm that you have your parent's or legal guardian's permission to use the Site and Game."
    },
    "useOfService": {
      "title": "Use of Service",
      "content": "You agree to use our Site and Game only for lawful purposes and in accordance with these Terms. You must not use our services for any illegal or unauthorized purpose, including but not limited to violating any intellectual property rights, privacy rights, or other rights of any person or entity."
    },
    "userAccounts": {
      "title": "User Accounts",
      "content": "To access certain features, you may need to create an account. You are responsible for maintaining the confidentiality of your account information and for all activities that occur under your account. You agree to notify us immediately of any unauthorized use of your account."
    },
    "userContent": {
      "title": "User Content",
      "content": "By submitting any content to our Site or Game, you grant us a worldwide, non-exclusive, royalty-free license to use, reproduce, modify, adapt, publish, translate, and distribute that content. You represent and warrant that you own or have the necessary rights to the content you submit."
    },
    "intellectualProperty": {
      "title": "Intellectual Property",
      "content": "The Site and Game, including their content, features, and functionality, are owned by us and are protected by copyright, trademark, and other intellectual property laws. You may not copy, modify, create derivative works, publicly display, sell, or exploit any of our content without our express written consent."
    },
    "prohibitedConduct": {
      "title": "Prohibited Conduct",
      "content": "You agree not to: (a) use our Site or Game in any unlawful manner, (b) harass, bully, or abuse other users, (c) transmit any harmful code or viruses, (d) attempt to gain unauthorized access to our systems, (e) interfere with the proper working of our Site or Game, or (f) create multiple accounts for abusive purposes."
    },
    "termination": {
      "title": "Termination",
      "content": "We reserve the right to terminate or suspend your access to our services at any time, without prior notice or liability, for any reason, including, without limitation, if you breach these Terms. Upon termination, your right to use the Site and Game will immediately cease."
    },
    "disclaimer": {
      "title": "Disclaimer",
      "content": "Our Site and Game are provided on an 'as is' and 'as available' basis. We do not warrant that our services will be uninterrupted, timely, secure, or error-free. We make no warranties regarding the accuracy, reliability, or quality of any information, content, or materials provided through the Site or Game."
    },
    "limitationOfLiability": {
      "title": "Limitation of Liability",
      "content": "To the maximum extent permitted by law, in no event will we be liable for any indirect, incidental, special, consequential, or punitive damages arising out of or relating to your use of our Site or Game. Our total liability for any claims relating to the Site or Game shall not exceed the amount you paid to us, if any, in the past twelve months."
    },
    "changes": {
      "title": "Changes to Terms",
      "content": "We reserve the right to modify these Terms at any time. We will provide notice of significant changes by posting an announcement on our Site or sending you an email. Your continued use of the Site or Game after such modifications constitutes your acceptance of the new Terms."
    },
    "contact": {
      "title": "Contact Us",
      "content": "If you have any questions about these Terms, please contact us at mertaslan16@gmail.com."
    }
  },
  "aboutTheGame": "About the Game",
  "gameExplanation": "Be the Odd One is a creative party game where players compete to come up with the most unique answers to given themes.",
  "howToPlay": "How to Play",
  "howToPlaySteps": {
    "setup": "Setup: Join a room with friends or create your own. Choose from existing theme packs or create your own custom themes.",
    "answering": "Answering: Each round, a theme is presented. Players submit their most unique answer related to the theme.",
    "scoring": "Scoring: Only unique answers earn points. The player with the most points at the end wins!"
  }
}

